app/controllers/posts_controller.rb

INSERT INTO "posts" ("caption", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["caption", "nom nom nom #coffeetime"], ["created_at", "2015-08-25 14:30:45.076180"], ["updated_at", "2015-08-25 14:30:45.076180"]]
---
  def create
    @post = Post.create(post_params)